
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.ams_api[0].azurerm_api_management_product_api.link_to_product[0]
* Update
  * module.ams_product[0].azurerm_api_management_product.product
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
* Replace
  * module.ams_api[0].azurerm_api_management_api.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ams_api[0].azurerm_api_management_api.api must be replaced
-/+ resource "azurerm_api_management_api" "api" {
      ~ id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/pre-api" -> (known after apply)
      ~ is_current            = true -> (known after apply)
      ~ is_online             = false -> (known after apply)
        name                  = "pre-api"
      ~ revision              = "3" -> "4" # forces replacement
      ~ soap_pass_through     = false -> (known after apply)
      + version               = (known after apply)
      + version_set_id        = (known after apply)
        # (8 unchanged attributes hidden)

      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.ams_api[0].azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + product_id          = "pre-api"
      + resource_group_name = "ss-stg-network-rg"
    }

  # module.ams_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pre-api"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.108.242",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":669,"Program":"tfcmt","SHA1":"","Vars":{}} -->